<a href="https://colab.research.google.com/github/RichardKameri/tydata/blob/main/housing_marketipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
# create a series of random numb
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [3]:
# create a second series of random numbers  1 to 3
s2 = pd.Series(np.random.randn(5))

In [4]:
# create a third series of random number from 10,000 to 30,000
s3 = pd.Series(np.random.randint(10000,30001, 5))

In [5]:
#create  a DataFrame by joinning the Series by column
df = pd.DataFrame( [s.values, s2.values, s3.values] ).T

In [6]:
# Change the name of the columns to bedrs, bathrs, price_sqr_meter
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']

In [7]:
# Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn
bigcolumn = pd.concat([s, s2, s3], axis=0)

In [8]:
# display the big column
bigcolumn

a        0.599505
b        0.742634
c       -1.391740
d        0.873087
e       -0.419238
0       -0.063856
1        0.363242
2       -1.190906
3        0.294336
4        0.038710
0    13942.000000
1    28505.000000
2    23597.000000
3    26130.000000
4    10994.000000
dtype: float64

In [9]:
# Reindex the DataFrame so it goes from 0 to 299
bigcolumn.reset_index(drop=True, inplace=True)

In [11]:
bigcolumn.describe()

count       15.000000
mean      6877.856385
std      10881.846327
min         -1.391740
25%         -0.012573
50%          0.599505
75%      12468.000000
max      28505.000000
dtype: float64

In [12]:
bigcolumn.info()

<class 'pandas.core.series.Series'>
RangeIndex: 15 entries, 0 to 14
Series name: None
Non-Null Count  Dtype
--------------  -----
15 non-null     float64
dtypes: float64(1)
memory usage: 248.0 bytes